import {  createSlice } from "@reduxjs/toolkit";

const initialState = {
	infoHomePage:
		{
			title: "Добро пожаловать на English Word Master — ваш персональный тренажёр для заучивания английских слов!",
			description: "Изучение английского языка — это ключ к новым возможностям, будь то карьера, путешествия или общение с людьми по всему миру. Но чтобы свободно говорить и понимать, важно постоянно пополнять свой словарный запас. С нашим тренажёром вы сможете учить слова легко, эффективно и с удовольствием!",
			advantagesTitle: "Почему выбирают нас?",
			advantages: [
				{
					title: "Индивидуальный подход",
					description: "Вы сами создаёте свой список слов для изучения. Добавляйте только те слова, которые вам нужны, и сосредоточьтесь на том, что действительно важно для вас.",
				},
				{
					title: "Удобство и простота",
					description: "Наш тренажёр интуитивно понятен и удобен в использовании. Вам не нужно тратить время на сложные настройки — просто добавьте слова и начните учить.",
				},
				{
					title: "Экономия времени",
					description: "Учите слова в любое время и в любом месте. Даже 10 минут в день с нашим тренажёром помогут вам значительно расширить словарный запас.",
				},
			],
			principlesOfWorkTitle: "Как это работает?",
			principlesOfWork: [
				{
					title: "Добавьте свои слова",
					description: "Создайте персональный список слов, которые хотите выучить. Это могут быть слова из книг, фильмов, работы или повседневной жизни.",
				},
				{
					title: "Учите с удовольствием",
					description: "Используйте тренажёр, чтобы повторять слова в удобном для вас режиме. Мы поможем вам запомнить их быстро и надолго.",
				},
				{
					title: "Следите за прогрессом",
					description: "Отмечайте, какие слова вы уже знаете, а какие нужно повторить. Ваш прогресс будет всегда перед глазами.",
				},
			],
			motivation:
				{
					title: "Начните прямо сейчас!",
					description: "Не откладывайте своё развитие на потом. Начните учить английские слова уже сегодня и откройте для себя новые горизонты. Просто зарегистрируйтесь, добавьте свои слова и приступайте к обучению.",
					slogan: "English Word Master — учите слова с умом!",
				},
			motivationAdd:
				{
					title: "Присоединяйтесь к нам!",
					description: "Уже тысячи пользователей улучшили свой английский с помощью нашего тренажёра. Станьте одним из них!",
					textLink: "Начать учить слова",
				},
			slogan: "English Word Master — ваш путь к свободному английскому!",
		}
};

export const homePageReducer = createSlice({
	name: "homePage",
	initialState,
})

export default homePageReducer.reducer;
